[
  {
    "id": 1,
    "name": "Kung Pao Cauliflower",
    "description": "Forget chicken: This sweet and spicy vegetarian dish proves once more that cauliflower is king. Originally from Sichuan province but popular in other parts of China, as well as in Chinese-American restaurants, kung pao chicken is traditionally a stir-fry. Here, the cauliflower is deep-fried for a light and crispy texture that pairs perfectly with the dish’s signature chiles and peanuts.",
    "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2018/8/1/0/FNK_KUNG-PAO-CAULIFLOWER-H_s4x3.jpg.rend.hgtvcom.791.633.suffix/1533148371584.jpeg",
    "ingredients": [
      "1/4 cup sweet chili sauce",
      "1 tablespoon low sodium soy sauce",
      "1 tablespoon white wine vinegar",
      "1 teaspoon toasted sesame oil",
      "2 tablespoons vegetable oil, plus more for frying",
      "3 scallions, thinly sliced, white and green parts separated",
      "1 medium jalapeño, thinly sliced",
      "One 1-inch piece ginger, minced",
      "2 large eggs",
      "3/4 cup cornstarch",
      "1 medium head cauliflower (about 2 pounds), cut into florets (6 to 7 cups)",
      "Kosher salt and freshly ground black pepper",
      "1/4 cup fresh cilantro leaves, chopped",
      "1 tablespoon roasted and salted peanuts, roughly chopped"
    ],
    "directions": [
      "Whisk together the sweet chili sauce, soy sauce, vinegar and sesame oil in a medium bowl",
      "Heat the vegetable oil in a large nonstick skillet over medium-high heat. Add the scallion whites and jalapeños and cook, stirring, until the jalapeños are soft and the seeds start to turn golden brown, 3 to 4 minutes. Add the ginger and cook, stirring, until soft, about 1 minute. Reduce the heat to medium and stir in the chili sauce mixture. Bring to a boil and let cook until slightly thickened, 1 to 2 minutes. Set aside and keep warm",
      "Fill a large heavy-bottom pot, fitted with a deep fry thermometer, with 2-inches of oil and heat the oil to 350 degrees F over medium-high heat. Set a wire rack in a rimmed baking sheet",
      "Whisk together the eggs, cornstarch and 1 tablespoon water in a medium bowl. Fold in the cauliflower until well coated in the batter. Add one-third of the cauliflower to the oil with a slotted spoon and fry, stirring as needed and adjusting the heat to maintain temperature, until golden, crispy and tender on the inside, about 6 minutes. Remove the cauliflower with the slotted spoon and transfer to the rack. Sprinkle with salt. Fry the remaining cauliflower, in 2 more batches, making sure the temperature of the oil comes back to 350 degrees F between each batch",
      "Add the fried cauliflower, 1/2 teaspoon salt and a few grinds of pepper to the sauce and gently toss to coat well. Transfer to a serving platter and sprinkle with cilantro, peanuts and the reserved scallion greens."
    ],
    "categories": [
      "Vegetarian",
      "Asian",
      "Chinese Recipes",
      "Cauliflower",
      "Vegetable",
      "Side Dish",
      "Deep-Frying"
    ]
  },
  {
    "id": 2,
    "name": "Beans Bourguignon",
    "description": "This vegan recipe is a wonderful alternative to classic beef bourguignon (and is fast, too). Dried porcinis are soaked to create a flavorful, earthy broth. Next, meaty mushrooms are browned to perfection, then added to a rich wine sauce along with carrots and the star of the show, cannellini beans, which soak up all the flavors as they simmer and naturally thicken the sauce so you can skip the usual flour. Served over herbed pasta, this dish is ideal for chilly nights when you crave a satisfying and cozy stick-to-your-ribs stew.",
    "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2023/1/23/new_fnk_beans_bourguignon_s4x3.jpg.rend.hgtvcom.826.620.suffix/1674489650075.jpeg",
    "ingredients": [
      "1 ounce dried porcini mushrooms",
      "1 1/2 cups boiling water",
      "1/4 cup plus 1 tablespoon olive oil",
      "1 pound cremini mushrooms, quartered",
      "Kosher salt and freshly ground black pepper",
      "3 small carrots (about 5 ounces), sliced 1/8 inch thick",
      "1 medium onion (about 10 ounces), chopped",
      "2 tablespoons tomato paste",
      "2 tablespoons fresh thyme leaves, chopped",
      "1 teaspoon fresh oregano leaves, chopped",
      "2 cloves garlic, thinly sliced",
      "1 1/2 cups vegan dry red wine, such as cabernet sauvignon",
      "8 ounces frozen pearl onions (about 2 cups)",
      "Two 15-ounce cans cannellini beans, drained and rinsed",
      "1 cup fresh flat-leaf parsley leaves, finely chopped, plus more for garnish, optional",
      "12 ounces cavatappi pasta"
    ],
    "directions": [
      "Place the porcini mushrooms in a medium heat-safe bowl. Pour the boiling water over top and let the porcini soak until the liquid is a very dark brown, about 20 minutes. Strain the liquid into a small liquid measuring cup (you should have about 3/4 cup), then chop the porcini and set aside.",

      "Meanwhile, heat 2 tablespoons of the olive oil in a large heavy-bottomed pot over medium-high heat until shimmering. Add the cremini mushrooms, 1 teaspoon salt and a generous amount of black pepper and stir so the cremini are in an even layer. Let the cremini cook, untouched, until starting to caramelize, about 3 minutes. Stir the cremini a few times and then continue to cook, untouched, until golden brown, about 3 minutes more. Transfer to a medium bowl with a slotted spoon and return the pot to the burner.",

      "Add another 2 tablespoons of the olive oil to the pot along with the carrots, onion, 1/2 teaspoon salt and a few grinds of black pepper. Cook, stirring occasionally, until the vegetables are softened, 4 to 5 minutes. Stir in the tomato paste, thyme, oregano, garlic and reserved porcini and cook, stirring frequently, until the tomato paste is toasted and turns a deep maroon color, 2 to 3 minutes.",

      "Stir in the wine, bring to a simmer and cook until reduced by half, 3 to 4 minutes. Fold in the pearl onions, cannellini, cremini, reserved porcini water, 1 teaspoon salt and a few grinds of black pepper and bring to a simmer. Cook, stirring occasionally, until the sauce is thick enough to coat the back of the spoon and the mushrooms are very soft, 8 to 10 minutes. Fold in 1/2 cup of the parsley.",

      "Meanwhile, bring a large pot of salted water to a boil. Cook the pasta until al dente according to package directions. Drain the pasta and add it back to the pot. Stir in the remaining 1 tablespoon olive oil and 1/2 cup parsley, 1 teaspoon salt and a few grinds of black pepper. Serve the beans bourguignon on top of the herbed pasta and garnish with more parsley if desired."
    ],
    "categories": [
      "Vegan",
      "Beef Bourguignon",
      "Beans and Legumes",
      "Main Dish",
      "High Fiber",
      "Vegetarian"
    ]
  },
  {
    "id": 3,
    "name": "Vegan Mac N \"Cheeze\"",
    "description": "I love this smooth, creamy rich sauce to pour over pasta for a cheesy, comforting dish! The butternut squash really makes this look like cheese sauce, the cashews make it super creamy, and the nutritional yeast gives it the cheesy flavor. I've made this using Banza, a gluten-free pasta made from chickpeas (and it's delicious)! But feel free to use your favorite pasta! Enjoy!",
    "url": "https://food.fnr.sndimg.com/content/dam/images/food/plus/fullset/2019/12/16/0/FNP_Gagarin_Vegan-Mac-n-Cheeze_H.jpg.rend.hgtvcom.826.620.suffix/1576531014174.jpeg",
    "ingredients": [
      "One 8-ounce box dried chickpea pasta or your favorite pasta",
      "1 tablespoon olive oil",
      "1/2 onion, diced",
      "1 carrot, sliced",
      "1 stalk celery, roughly chopped",
      "2 cups peeled and cubed butternut squash",
      "1/2 cup raw cashews",
      "1 1/2 teaspoons fine sea salt",
      "2 tablespoons nutritional yeast",
      "1/4 teaspoon garlic powder",
      "Torn fresh parsley leaves, for serving"
    ],
    "directions": [
      "Bring a large pot of water to a boil.",

      "Heat the olive oil in a large saucepan over medium heat. Add the diced onion and cook until softened, 1 to 2 minutes.",

      "Add the celery and carrots and cook until the vegetables have softened, 1 to 2 minutes. Add the butternut squash and cook until slightly browned, 6 to 8 minutes. Add just enough water (about 2 cups) to barely cover the vegetables. Add the cashews and 1 teaspoon salt, bring to a boil and cook until the vegetables are tender when pierced with a fork, about 10 minutes, but cooking time will vary slightly, depending on the size of the vegetables.",

      "For the pasta: Salt the water and cook the pasta to al dente according to package instructions. Drain and set aside.",

      "For the breadcrumb topping: Roughly chop the bread and pulse in a food processor until the bread resembles coarse crumbs. Heat the oil in a small skillet over medium-high heat. Add the breadcrumbs, garlic powder, paprika and salt and toss to combine. Cook, tossing regularly, until golden and crispy, 3 to 5 minutes.",

      "Transfer the vegetable-cashew mixture to a blender along with the remaining cooking liquid. Blend until smooth, then add the nutritional yeast, garlic powder and the remaining 1/2 teaspoon salt. Blend until smooth, then taste and adjust the seasoning to taste.",

      "Pour the creamy sauce over the cooked pasta and toss to combine.",

      "Sprinkle with crispy breadcrumbs and parsley and serve."
    ],
    "categories": [
      "Vegan",
      "Macaroni and Cheese",
      "Main Dish",
      "High Fiber",
      "Vegetarian"
    ]
  },
  {
    "id": 4,
    "name": "Vegan Tostadas",
    "description": "Black beans and walnuts create the base for these tasty vegan tostadas. They're made with crispy gluten-free organic corn tortillas and topped with crunchy pepitas, sweet yellow corn and red bell peppers.",
    "url": "https://food.fnr.sndimg.com/content/dam/images/food/plus/fullset/2020/02/21/0/FNKLive_Whitney-English-Vegan-Tostadas_0011_s4x3.jpg.rend.hgtvcom.826.620.suffix/1582304288901.jpeg",
    "ingredients": [
      "1 cup raw walnuts",
      "1 cup canned black beans, rinsed and drained",
      "2 tablespoons extra-virgin olive oil",
      "1/2 medium yellow onion, diced",
      "1 garlic clove, minced",
      "1 cup canned diced tomatoes with juices",
      "1 tablespoon ground cumin",
      "1 tablespoon dried oregano",
      "1/2 teaspoon cayenne pepper (optional)",
      "Kosher salt and freshly ground black pepper",
      "6 organic corn tortillas",
      "1 cup vegan shredded cheese (optional; see Cook's Note)"
    ],
    "directions": [
      "Place the walnuts in a large skillet and cook over high heat, stirring occasionally, until toasted, about 3 minutes.",

      "Transfer the nuts to a food processor and reserve the skillet. Add the beans to the food processor and pulse with the nuts until the mixture is fully incorporated but not mushy. Set aside.",

      "Heat 1 tablespoon of the oil in the same skillet over medium heat. Add the onions and garlic and cook, stirring, until the onions are softened, 2 to 3 minutes.",

      "Add the bean mixture, tomatoes, cumin, oregano and cayenne, and stir to incorporate. Cook until the mixture is heated through, about 5 minutes.",

      "Meanwhile, brush both sides of each of the corn tortillas with the remaining oil. Place on a baking sheet and bake until crispy, flipping halfway through, about 6 minutes total.",

      "Remove the tostadas from the oven and top with the bean mixture, then the shredded cheese. Bake until the cheese is melted, about 5 minutes.",

      "Add your desired toppings and enjoy!",

      "Cook’s Note: I melt vegan cheese on top of mine, but you can skip it if you’re not a fan, or if you do dairy, use regular cheese."
    ],
    "categories": [
      "Vegan",
      "Latin American Recipes",
      "Main Dish",
      "Gluten Free"
    ]
  },
  {
    "id": 5,
    "name": "Healthy Air Fryer Parmesan Chicken with Broccoli",
    "description": "This chicken gets incredibly crunchy, thanks to a light coating of panko and Parmesan and a quick cook in the air fryer! Serve it with charred broccoli and a tangy yogurt sauce for a healthy and complete meal you can throw together any day of the week.",
    "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2020/11/16/0/FNK_Air-Fryer-Parmesan-Chicken-Broccoli_H1_s4x3.jpg.rend.hgtvcom.826.620.suffix/1605561210481.jpeg",
    "ingredients": [
      "1/3 cup panko",
      "1/4 cup finely grated Parmesan",
      "4 teaspoons olive oil",
      "1/2 teaspoon dried oregano",
      "Kosher salt and freshly ground black pepper",
      "2 small boneless, skinless chicken breasts (about 6 ounces each)",
      "1 1/2 tablespoons plus 1/4 teaspoon Dijon mustard",
      "2 cups small broccoli florets (about 5 ounces)",
      "1/4 cup low-fat plain yogurt",
      "Finely grated zest and juice of 1/2 lemon"
    ],
    "directions": [
      "Stir together the panko, Parmesan, 2 teaspoons of the olive oil, the oregano, pinch of salt and a couple grinds of pepper in a shallow bowl or small baking dish until thoroughly combined. Pat the chicken dry between a couple paper towels, then sprinkle lightly with salt and pepper. Brush both sides of the chicken with 1 1/2 tablespoons of the Dijon, then press into the panko-Parmesan mixture, making sure both sides are evenly coated.",

      "Toss the broccoli, remaining 2 teaspoons of the olive oil, a good pinch of salt and several grinds of pepper in a medium bowl until evenly coated. ",

      "Preheat a 3.5-quart air fryer to 375 degrees F. Add the chicken to the air-fryer basket and cook until it’s starting to brown and crisp on the top, about 6 minutes. Flip the chicken over with tongs and position in the center of the basket, then scatter the broccoli around the perimeter. Continue air-frying until the chicken is crisp all over and an instant-read thermometer inserted in the middle registers 160 degrees F, and the broccoli is tender and charred, about 8 minutes more. ",

      "Meanwhile, stir together the yogurt, lemon zest and juice, remaining 1/4 teaspoon Dijon, a pinch of salt and several grinds of pepper in a small bowl. Serve alongside the chicken and broccoli for dipping."
    ],
    "categories": [
      "Healthy",
      "Broccoli",
      "Vegetable",
      "Chicken Breast",
      "Cheese",
      "Parmesan Cheese Recipes",
      "Main Dish",
      "Recipes for Two"
    ]
  },
  {
    "id": 6,
    "name": "Air Fryer Eggplant Parm",
    "description": "Eggplant Parmesan is a dish I grew up eating—both at my Nonna’s house in the Bronx and any red checkered tablecloth Italian joint. This version is lightened up thanks to the air fryer, but still delivers on the promise of crispy eggplant smothered in red sauce and ooey gooey cheese. The best part: it comes together in a snap and there is no oil to clean up after dinner. So, pour yourself a glass of chianti and enjoy!",
    "url": "https://food.fnr.sndimg.com/content/dam/images/food/plus/fullset/2021/03/05/0/FNKLIve_Dana-Beninati_Air-Fryer-Eggplant-Parm-2-2_s4x3.jpg.rend.hgtvcom.826.620.suffix/1614983630157.jpeg",
    "ingredients": [
      "3/4 cup all-purpose flour",
      "Kosher salt and freshly ground black pepper",
      "2 large eggs",
      "1 1/4 cups panko or plain dried breadcrumbs",
      "3/4 cup grated Parmesan, plus more for serving",
      "2 tablespoons dried Italian herb seasoning",
      "3 teaspoons garlic powder",
      "One 1-pound eggplant, peeled and very thinly sliced crosswise",
      "2 cups jarred tomato sauce",
      "3 tablespoons chopped fresh basil leaves, plus more leaves for serving if desired",
      "16 ounces fresh pre-sliced mozzarella",
      "Extra-virgin olive oil, for serving, optional"
    ],
    "directions": [
      "Preheat a 6-quart air fryer to 375 degrees F. Line a baking sheet with parchment paper.",
      "Whisk together the flour, 1/4 teaspoon kosher salt, and a couple grinds of pepper in a shallow bowl. Whisk together the eggs and a splash of water in a second shallow bowl. Whisk together the panko, Parmesan, dried Italian herb seasoning, 2 teaspoons garlic powder, 1/4 teaspoon salt, and a couple grinds of pepper in a third shallow bowl.",
      "Dip the eggplant slices into the flour mixture and shake off any excess. Place into the egg wash and flip to evenly coat. Allow any excess egg to drip off, then press in the panko mixture, making sure both sides are evenly coated. Place on the prepared baking sheet.",
      "Gently place half of the breaded eggplant into the air fryer basket, shingling to create a single layer. Cook, shaking the tray halfway through to separate any rounds that may have stuck together, until golden brown and crispy, 13 to 15 minutes. Place the cooked eggplant on the prepared baking sheet, then repeat with the remaining uncooked breaded eggplant.",
      "Meanwhile, stir together the tomato sauce, the remaining 1 teaspoon of garlic powder, and the chopped basil in a small saucepan and cook over medium-low heat until simmering and warmed through, about 5 minutes.",
      "Line the air fryer basket with parchment, then add half of the cooked eggplant in a single layer. Cover the eggplant to the edges with 1 cup of the seasoned tomato sauce. Top with 8 ounces of the mozzarella. Repeat with the remaining cooked eggplant, 1 cup seasoned tomato sauce, and 8 ounces mozzarella to create a second layer. Cook until the edges are deeply golden brown and the cheese melts, 5 to 7 minutes.",
      "Remove to a serving platter. Drizzle with olive oil and garnish with fresh basil leaves if desired. Serve immediately, although it will be even better the next day!"
    ],
    "categories": [
      "Cheese",
      "Mozzarella Recipes",
      "Eggplant Recipes",
      "Vegetable",
      "Parmesan Cheese Recipes",
      "Main Dish",
      "High Fiber",
      "Vegetarian"
    ]
  },
  {
    "id": 7,
    "name": "Skillet Chicken Thighs with White Wine–Butter Sauce",
    "description": "The stovetop-to-oven cast-iron skillet technique in this recipe is our go-to for achieving crispy, juicy chicken thighs. If you’re tight on time, the chicken is delicious without the butter sauce (simply plate the thighs straight out of the oven). But to truly impart restaurant-worthy flavor, try your hand at the classic white wine and butter sauce known as beurre blanc in French. The recipe makes a plentiful amount of sauce; nestle the chicken into some of it, then spoon more over every other component of your dinner.",
    "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2021/09/23/0/FNK_Skillet-Chicken-Thighs_H1_s4x3.jpg.rend.hgtvcom.826.620.suffix/1632420651769.jpeg",
    "ingredients": [
      "4 skin-on, bone-in chicken thighs (about 2 pounds)",
      "Kosher salt and coarsely ground black pepper",
      "1/3 cup champagne vinegar",
      "1/3 cup dry white wine",
      "2 shallots, finely chopped",
      "1/2 lemon, juiced",
      "2 bay leaves",
      "1/2 cup heavy cream",
      "1/2 pound (2 sticks) unsalted butter, cubed",
      "1/4 cup chopped chives"
    ],
    "directions": [
      "Preheat the oven to 450 degrees F.",
      "Pat the chicken dry with paper towels. Sprinkle them on both sides with 1 1/2 teaspoons each salt and pepper.",
      "Heat a large oven-proof skillet (preferably cast iron) over medium-high heat. Add the chicken thighs to the skillet skin-side down and cook, moving them around once or twice to ensure even browning, until the skin is very golden brown, 11 to 12 minutes.",
      "Turn off the heat. Grasp a wad of paper towels with tongs and mop up excess fat in the bottom of the skillet—this will prevent the grease from spattering all over your oven; carefully discard the paper towel. Repeat several times until there’s only a thin film of oil over the bottom of the skillet.",
      "Transfer the skillet to the oven and roast until the chicken is almost cooked through, 6 to 8 minutes. Flip the thighs so they are skin side up, then continue roasting until no longer pink near the bone, another 6 minutes. Remove the skillet from the oven and transfer the chicken thighs to a plate, skin side up. Wipe out the skillet and set aside.",
      "Meanwhile, start your sauce. Combine the vinegar, wine, shallots, lemon juice and bay leaves in a heavy 2-quart saucepan. Simmer over medium heat until the mixture is reduced to a wet paste, 8 to 10 minutes. Add the cream and continue to simmer until the mixture is reduced to about 2 tablespoons.",
      "Reduce the heat to low and remove the bay leaves. Add a few chunks of the butter and whisk constantly until melted, then add a few more chunks and whisk again until melted. Continue adding and whisking the butter, which should melt into a creamy emulsion, until all the butter is incorporated, about 4 minutes. Do not let the sauce go over 130 degrees F or it will separate. If the sauce starts to break, remove from the heat, add 2 ice cubes and whisk until it cools down and comes back together.",
      "Season the sauce with 1/2 teaspoon salt and a pinch of pepper. Transfer it to the cast iron skillet, nestle the chicken on top and sprinkle the whole dish with chives. Serve immediately."
    ],
    "categories": [
      "Skillet Recipes",
      "Chicken Thigh",
      "Main Dish",
      "Gluten Free"
    ]
  },
  {
    "id": 8,
    "name": "Slow-Cooker Chicken Thighs",
    "description": "Soy sauce, honey, garlic and ginger (along with the natural juices of the chicken) become irresistible sauce to serve over chicken thighs and rice. If you like a thicker sauce, simply add cornstarch at the end and cook a little longer.",
    "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2016/11/3/1/FNK_Slow-Cooker-Chicken-Thighs_s4x3.jpg.rend.hgtvcom.826.620.suffix/1478232033629.jpeg",
    "ingredients": [
      "Nonstick cooking spray",
      "8 boneless skinless chicken thighs (2 to 2 1/2 pounds total)",
      "1/3 cup honey",
      "1/3 cup ketchup",
      "1/3 cup low-sodium soy sauce",
      "1/2 teaspoon dried oregano",
      "1/4 teaspoon crushed red pepper flakes",
      "6 cloves garlic, peeled and smashed",
      "One 1-inch piece ginger, peeled and minced",
      "2 tablespoons cornstarch, optional",
      "1 teaspoon toasted sesame seeds",
      "Chopped scallions and cooked white rice, for serving"
    ],
    "directions": [
      "Coat the insert of a 6-quart slow cooker with cooking spray and add the chicken thighs.",
      "In a glass measuring cup, whisk together the honey, ketchup, soy sauce, oregano, pepper flakes, garlic, and ginger and pour over the chicken.",
      "Cover and cook on low until the chicken is cooked through and tender, 5 to 6 hours.",
      "Turn off the heat, uncover, and let rest for about 10 minutes before serving. The chicken and sauce can be served as-is or, for a thicker sauce, remove the chicken and set aside, covered, to keep warm, then turn the slow cooker to high.",
      "Stir the cornstarch and 2 tablespoons cold water together until it resembles heavy cream. Pour the mixture into the sauce, cover, and cook until the sauce is thick and bubbling, about 30 minutes. (The mixture must come to a boil to activate the starch and thicken the sauce.)",
      "Return the chicken back to the sauce and heat the chicken through, about 5 minutes.",
      "Transfer the chicken and sauce to a platter, sprinkle with the sesame seeds and scallions, and serve hot with rice."
    ],
    "categories": [
      "Chicken Recipes",
      "Poultry",
      "Chicken Thigh",
      "Main Dish",
      "Recipes for Parties",
      "Super Bowl",
      "Slow-Cooker"
    ]
  },
  {
    "id": 9,
    "name": "Slow-Cooker Pinto Beans",
    "description": "If you have yet to cook beans from scratch and own a slow cooker, this is the recipe for you! It comes together with pantry ingredients, requires minimal prep and thanks to the slow cooker, you’ll be rewarded with plump, perfectly tender beans with almost zero hands-on time. (Navy beans would also work well here.) Seasoned with warm spices and pickled jalapenos, they are a great side dish. Or serve them over rice or with warm tortillas as a meal.",
    "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2021/05/07/0/FNK_SLOW_COOKER_PINTO_BEANS_H_f_s4x3.jpg.rend.hgtvcom.826.620.suffix/1620410836872.jpeg",
    "ingredients": [
      "1 pound dried pinto beans, rinsed and picked over (see Cook’s Note)",
      "48 ounces low-sodium chicken broth (or one 32-ounce carton plus 2 cups water)",
      "One 8-ounce jar mild or hot diced pickled jalapeños",
      "2 tablespoons dried oregano",
      "1 tablespoon ground cumin",
      "3 cloves garlic",
      "2 dried bay leaves",
      "1/4 cup cilantro leaves plus 1/4 cup chopped cilantro stems, optional",
      "Kosher salt",
      "3/4 cup shredded sharp Cheddar or crumbled Cotija or queso fresco",
      "1 lime, cut into wedges"
    ],
    "directions": [
      "Put the beans, chicken broth, pickled jalapeños and brine from the jar in a 4-to-7-quart slow cooker.",
      "Stir in the oregano, cumin, garlic, bay leaves, cilantro stems if using, and 1 teaspoon salt.",
      "Cover and cook on high until the beans are tender but still hold their shape, 8 to 10 hours.",
      "Remove and discard the bay leaves. Use the back of a spoon to smash the garlic cloves, then stir them into the beans.",
      "Serve topped with the cheese, cilantro leaves, and lime wedges."
    ],
    "categories": [
      "Beans and Legumes",
      "Side Dish",
      "Slow-Cooker",
      "Gluten Free",
      "High Fiber",
      "Low-Fat"
    ]
  },
  {
    "id": 10,
    "name": "Slow-Cooker Italian Meatballs",
    "description": "These meatballs taste just like your nonna’s without any pre-cooking or tending to—just throw them in the slow cooker with the rest of the ingredients. The recipe makes enough meatballs and sauce to serve with two pounds of pasta. They are also delicious over polenta, stuffed into sub rolls or as a pizza topping.",
    "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2021/02/25/0/FNK_Slow-Cooker-Italian-Meatballs_H1_s4x3.jpg.rend.hgtvcom.826.620.suffix/1614271884539.jpeg",
    "ingredients": [
      "Two 28-ounce cans whole plum tomatoes",
      "One 6-ounce can tomato paste",
      "3 tablespoons extra-virgin olive oil",
      "1 teaspoon dried oregano",
      "1/4 teaspoon crushed red pepper flakes",
      "3 cloves garlic, crushed and peeled",
      "2 bay leaves",
      "Kosher salt",
      "1 small onion, cut into chunks",
      "1 small carrot, cut into chunks",
      "1 celery stalk, cut into chunks",
      "1/2 cup fresh Italian parsley leaves",
      "2 cloves garlic, crushed and peeled",
      "1 pound 90 percent lean ground beef",
      "1 pound ground pork",
      "2 large eggs",
      "3/4 cup Italian seasoned breadcrumbs",
      "1/2 cup grated Parmesan",
      "Kosher salt"
    ],
    "directions": [
      "Pour the tomatoes into a 4- to 6-quart slow cooker and crush by hand.",
      "Stir in the tomato paste, olive oil, oregano, pepper flakes, garlic, bay leaves, and 2 teaspoons salt.",
      "Place the onions, carrots, celery, parsley, and garlic in a food processor and pulse to make a paste.",
      "Transfer to a large bowl and add the beef, pork, eggs, breadcrumbs, Parmesan, and 1 teaspoon salt.",
      "Form into 1 1/2-inch meatballs (you should get about 20 to 24) and nestle into the sauce in the slow cooker.",
      "Cover and cook on high for 4 to 5 hours or low for 7 to 8 hours.",
      "Discard the bay leaves before serving."
    ],
    "categories": [
      "Meatballs",
      "Main Dish",
      "Slow-Cooker",
      "Recipes for a Crowd"
    ]
  }
]
